In [1]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {"name":['Harry', 'Rohan', 'Gomati', 'Shubh'],
         "marks":[12, 34, 24, 67],
         "city":['Rampur', 'Kolkata', 'Bareilly', 'Chetanpur']
         }

In [6]:
df = pd.DataFrame(dict1) #it will show data in tabular form

In [7]:
df

     name  marks       city
0   Harry     12     Rampur
1   Rohan     34    Kolkata
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [8]:
df.to_csv('colleague.csv') #excel sheet is created

In [12]:
colleague = pd.read_csv('colleague.csv') #excel sheet read in python

In [13]:
colleague

   Unnamed: 0    name  marks       city
0           0   Harry     12     Rampur
1           1   Rohan     34    Kolkata
2           2  Gomati     24   Bareilly
3           3   Shubh     67  Chetanpur

In [14]:
colleague['marks'] #only column marks

0    12
1    34
2    24
3    67
Name: marks, dtype: int64

In [15]:
colleague['marks'][0] #particular index value

12

In [16]:
colleague['marks'][0] = 60 #it will give a warning but the value is changed

C:\Users\DEVARSHI SHAH\AppData\Local\Temp\ipykernel_13152\2991401856.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  colleague['marks'][0] = 60

In [17]:
colleague #u can observe that the value is changed of the harry marks which is index = 0

   Unnamed: 0    name  marks       city
0           0   Harry     60     Rampur
1           1   Rohan     34    Kolkata
2           2  Gomati     24   Bareilly
3           3   Shubh     67  Chetanpur

In [18]:
colleague.index = ['first', 'second', 'third', 'fourth']

In [19]:
colleague

        Unnamed: 0    name  marks       city
first            0   Harry     60     Rampur
second           1   Rohan     34    Kolkata
third            2  Gomati     24   Bareilly
fourth           3   Shubh     67  Chetanpur

In [ ]:
df.to_csv('colleague_index_false.csv', index=False) #index will not be printed in this excel sheet

In [9]:
df.head(2) #it will show the first 2 rows

    name  marks     city
0  Harry     12   Rampur
1  Rohan     34  Kolkata

In [10]:
df.tail(2) #it will show the last 2 rows

     name  marks       city
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [11]:
df.describe()

           marks
count   4.000000
mean   34.250000
std    23.613203
min    12.000000
25%    21.000000
50%    29.000000
75%    42.250000
max    67.000000